Dragon.seed do |s|
  s.id = 1
  s.name = "レッドドラゴン"
  s.image = "redDragon.png"
  s.explanation = "炎のように熱く燃える赤竜"
  s.personality = "このドラゴンが心の中に住んでるあなたは、正に心が燃えている真っ最中。何事にも精力的に取り組めており、周囲への影響力も大きいあなたは辺りを照らす炎のよう。"
  s.advice = "Twitterの使い方は順調な様子。熱くなりすぎて自他共に火傷しないように注意!"
  s.affinity = "呟きの傾向が近いイエロードラゴンの人とは相性がよさそう。活動力が低めなイエローの人を引っ張ってあげましょう。"
end
Dragon.seed do |s|
  s.id = 2
  s.name = "イエロードラゴン"
  s.image = "yellowDragon.png"
  s.explanation = "おしゃれで見栄っ張りな王様"
  s.personality = "このドラゴンが心の中に住んでるあなたは、誰かに自分を認めてほしい気持ちが強いかも。色々とおしゃれして飾り立てているけど、あまり結果には結びついてはいない様子。"
  s.advice = "ツイートの内容には力が入っている様子。行動力は低めなので、認められたければもう少し積極的になった方がいいかも。"
  s.affinity = "同じく前向きでより積極的なレッドドラゴンの人からは学べる点が多いので絡んでみては？"
end
Dragon.seed do |s|
  s.id = 3
  s.name = "グリーンドラゴン"
  s.image = "greenDragon.png"
  s.explanation = "自然を見守る長老"
  s.personality = "このドラゴンが心の中に住んでるあなたは、メンタルが安定している様子。面倒みが良く、どっしりと構えて頼れる様はまるで神様。"
  s.advice = "ポジティブ且つアクティブな一方で、感情は安定しているようです。時には感情を出してみるのも人を引きつける手段です。"
  s.affinity = "前向きだけど冷静なホワイトドラゴンの人とは、ちょっとお節介なところを見直してくれる切っ掛けに。"
end
Dragon.seed do |s|
  s.id = 4
  s.name = "ホワイトドラゴン"
  s.image = "whiteDragon.png"
  s.explanation = "凍てつくほど冷静な白竜"
  s.personality = "このドラゴンが心の中に住んでるあなたは、淡々と事を進める職人気質。その冷静さは絶対零度が如く。"
  s.advice = "ツイート内容は前向きだけど、感情の起伏は小さい模様。Twitter利用には消極的なようなので、もう少しアクティブになっても良いかもしれません。"
  s.affinity = "ちょっと冷たいホワイトドラゴンの人は温かみのあるグリーンドラゴンの人から熱をもらいましょう。"
end
Dragon.seed do |s|
  s.id = 5
  s.name = "グレードラゴン"
  s.image = "grayDragon.png"
  s.explanation = "全てを腐食させる毒竜"
  s.personality = "このドラゴンが心の中に住んでるあなたは、ネガティブで強い感情が周囲に出ている傾向が見られます。周りを腐食させる毒のせいで他のドラゴンや人が離れていってしまうかも。"
  s.advice = "ネガティブ度が強い感情的なツイートを多くしがちな様子。呟く前に文章を見直して見るのが吉。"
  s.affinity = "内に潜める強い感情が毒にならないように、パープルドラゴンの人に中和してもらいましょう。"
end
Dragon.seed do |s|
  s.id = 6
  s.name = "ブルードラゴン"
  s.image = "blueDragon.png"
  s.explanation = "雄大な海の主"
  s.personality = "このドラゴンが心の中に住んでるあなたは、静かな言葉の内にも強い感情を秘めている様子。普段穏やかな海であっても時には災害を引き起こすことをお忘れなく。"
  s.advice = "言いたいことが色々と溜まっているかも。Twitter以外の場所で本音を吐き出せると良し。"
  s.affinity = "冷静で内向的なブラックドラゴンの人とは感情をむき出しにしなければ無理なく付き合えそう。"
end
Dragon.seed do |s|
  s.id = 7
  s.name = "パープルドラゴン"
  s.image = "purpleDragon.png"
  s.explanation = "いたずら好きな猫竜"
  s.personality = "このドラゴンが心のなかに住んでいるあなたは、他のドラゴンや人が恋しい様子。普段はつれないのに自分が構って欲しい時だけちょっかいを出す姿はまさに猫。"
  s.advice = "Twitterの使用頻度は高いようですが、病みツイートをしてしまう傾向あり。たまにはTwitterから離れて気持ちを落ち着けよう。"
  s.affinity = "同じくダウナーだけど積極的なグレードラゴンの人とは気が合うかも。互いに依存関係にはならないように注意。"
end
Dragon.seed do |s|
  s.id = 8
  s.name = "ブラックドラゴン"
  s.image = "blackDragon.png"
  s.explanation = "漆黒の闇に佇む黒竜"
  s.personality = "このドラゴンが心のなかに住んでいるあなたは、ちょっとお疲れ気味な模様。あまりに闇が濃くなると自分の尻尾を噛んでしまうかも。"
  s.advice = "病みツイートをする傾向にあるけど、Twitterの使用頻度も高くない様子。辛い時は無理にTwitterじゃなくても現実の頼れる人に相談を。"
  s.affinity = "誰かと話したい時はブルードラゴンの人と。ブルーの人の強い感情を抑えてあげるのもいいでしょう。"
end